UrbanSound8KClassifier(
  (root): Sequential(
    (0): StdConv1d(768, 768, kernel_size=(14,), stride=(2,), padding=(6,), bias=False)
    (1): BatchNorm1d(768, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
    (2): ReLU()
  )
  (maxPool): MaxPool1d(kernel_size=6, stride=2, padding=2, dilation=1, ceil_mode=False)
  (layers): ModuleList(
    (0): FCEResNetBlock(
      (conv1): StdConv1d(768, 384, kernel_size=(1,), stride=(1,), bias=False)
      (norm1): BatchNorm1d(384, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (conv2): StdConv1d(384, 384, kernel_size=(7,), stride=(2,), padding=(3,), bias=False)
      (norm2): BatchNorm1d(384, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (conv3): StdConv1d(384, 1536, kernel_size=(1,), stride=(1,), bias=False)
      (norm3): BatchNorm1d(1536, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU(inplace=True)
      (downsample): StdConv1d(768, 1536, kernel_size=(1,), stride=(2,), bias=False)
      (ds_gn): BatchNorm1d(1536, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
    (1): FCEResNetBlock(
      (conv1): StdConv1d(1536, 384, kernel_size=(1,), stride=(1,), bias=False)
      (norm1): BatchNorm1d(384, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (conv2): StdConv1d(384, 384, kernel_size=(7,), stride=(1,), padding=(3,), bias=False)
      (norm2): BatchNorm1d(384, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (conv3): StdConv1d(384, 1536, kernel_size=(1,), stride=(1,), bias=False)
      (norm3): BatchNorm1d(1536, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU(inplace=True)
    )
    (2): FCEResNetBlock(
      (conv1): StdConv1d(1536, 384, kernel_size=(1,), stride=(1,), bias=False)
      (norm1): BatchNorm1d(384, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (conv2): StdConv1d(384, 384, kernel_size=(7,), stride=(1,), padding=(3,), bias=False)
      (norm2): BatchNorm1d(384, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (conv3): StdConv1d(384, 768, kernel_size=(1,), stride=(1,), bias=False)
      (norm3): BatchNorm1d(768, eps=1e-06, momentum=0.1, affine=True, track_running_stats=True)
      (relu): ReLU(inplace=True)
      (downsample): StdConv1d(1536, 768, kernel_size=(1,), stride=(1,), bias=False)
      (ds_gn): BatchNorm1d(768, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
  )
  (avgPool): AdaptiveAvgPool1d(output_size=1)
  (norm1): LayerNorm((384,), eps=1e-05, elementwise_affine=True)
  (fc1): Linear(in_features=768, out_features=384, bias=True)
  (fc2): Linear(in_features=384, out_features=10, bias=True)
)