Classifier(
  (fc1): Linear(in_features=768, out_features=384, bias=True)
  (bn1): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (fc2): Linear(in_features=384, out_features=35, bias=True)
)